ERP/src/Catalogs/Сервер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сервер</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IP_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SSH_Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SSH_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WGD_API_Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WGD_TLS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WGD_Домен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WGD_Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WGD_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WGD_Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитТрафика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумСлотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПанельУправления_URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПанельУправления_Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПанельУправления_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускнаяСпособность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионСервера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГеографическийРегион</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERP/src/InformationRegisters/КонфигурацииСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонфигурацииСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/СлотыКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СлотыКонфигураций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НазваниеПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСлотаКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСлота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>44</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/Enums/СтатусКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусКонфигурации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСуществует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПустаяПриДобавлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERP/src/Catalogs/Сервер/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьНовуюКонфигурацию(Команда)
	
	ОтобразитьПредупреждение = ДобавитьНовуюКонфигурациюНаСервере();
	
	Если ОтобразитьПредупреждение <> Неопределено Тогда
		
		ПредупреждениеАсинх(ОтобразитьПредупреждение,,"Не удалось добавить конфигурацию");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьНовуюКонфигурациюНаСервере()	
	
	КонфигурацияУжеЕсть = ?(
		КонфигурацииСервера.НайтиСтроки(Новый Структура("ИмяКонфигурации", ИмяНовойКонфигурации)).Количество() <> 0,
		Истина, Ложь
	);
	
	Если КонфигурацияУжеЕсть Тогда
			
		Возврат "Конфигурация с таким именем уже есть";
		
	КонецЕсли;

	СтатусКонфигурации = WGD_Соединение.ПолучитьСтатусКонфигурации(ИмяНовойКонфигурации, Объект.Ссылка, Истина);
	Если СтатусКонфигурации = Перечисления.СтатусКонфигурации.Ок ИЛИ
			СтатусКонфигурации = Перечисления.СтатусКонфигурации.Выключена Тогда
			
		ДобавитьКонфигурациюВТаблицу(ИмяНовойКонфигурации, ЛимитСлотовНовойКонфигурации, 0, СтатусКонфигурации);
		//РегистрыСведений.КонфигурацииСервера.ДобавитьНовуюКонфигурацию(Объект.Ссылка, ИмяНовойКонфигурации, ЛимитСлотовНовойКонфигурации);
		// TODO Проверить все тут
	ИначеЕсли СтатусКонфигурации = Перечисления.СтатусКонфигурации.НеПустаяПриДобавлении Тогда
		
		Возврат "Перед добавлением, необходимо очистить конфигурацию";
		
	ИначеЕсли СтатусКонфигурации = Перечисления.СтатусКонфигурации.НеСуществует Тогда
		
		Возврат "Конфигурации с таким именем не существует";
		
	ИначеЕсли СтатусКонфигурации = Перечисления.СтатусКонфигурации.ОшибкаЗапроса Тогда
		
		Возврат "Возникла ошибка при запросе на сервер";
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДобавитьКонфигурациюВТаблицу(ИмяКонфигурации, МаксимумСлотов, СлотовЗанято, Статус)
	
	НоваяСтр = КонфигурацииСервера.Добавить();
	НоваяСтр.ИмяКонфигурации = ИмяКонфигурации;
	НоваяСтр.Слоты = СтрШаблон("%1 из %2", СлотовЗанято, МаксимумСлотов);
	НоваяСтр.Статус = Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацииСервераПередУдалением(Элемент, Отказ)
	    
    Отказ = Истина;
    ПараметрыОповещения = Новый Структура("ВыделенныеСтроки", Элемент.ВыделенныеСтроки);
    ОповещениеПриОтветеНаВопрос = Новый ОписаниеОповещения(
		"РезультатОтветаНаВопросОбУдаленииКонфигурацииСервера", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВопрос(
		ОповещениеПриОтветеНаВопрос,
		"Вы уверены? Удаление конфигурации может привести к нежелательным последствиям", // TODO изменение текста в зависимости от того есть подписчики на конфигурации, или нет
		РежимДиалогаВопрос.ДаНет,,,"Подтверждение удаления");
    
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтветаНаВопросОбУдаленииКонфигурацииСервера(Результат, Параметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		СтрокиДляУдаления = Новый Массив;
        Для Каждого Идентификатор Из Параметры.ВыделенныеСтроки Цикл
            НайденнаяУдаляемаяСтрока = КонфигурацииСервера.НайтиПоИдентификатору(Идентификатор);
            СтрокиДляУдаления.Добавить(НайденнаяУдаляемаяСтрока);
        КонецЦикла;
        
		Для Каждого УдаляемаяСтрока Из СтрокиДляУдаления Цикл
			СерверыVPN_ВызовСервера.УдалитьКонфигурацию(Объект.Ссылка, УдаляемаяСтрока.ИмяКонфигурации);
            КонфигурацииСервера.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыКонфигураций(Команда)
	КонфигурацииСервера.Очистить();
    ЗаполнитьТаблицуКонфигураций();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
    	ЗаполнитьТаблицуКонфигураций();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонфигураций()
	
	Конфигурации = РегистрыСведений.КонфигурацииСервера.ВсеКонфигурацииСервера(Объект.Ссылка);
	
	Для Каждого Стр Из Конфигурации Цикл
		
		СлотовЗанято = РегистрыСведений.СлотыКонфигураций.КоличествоСлотовЗанято(Объект.Ссылка, Стр.ИмяКонфигурации);
		Статус = WGD_Соединение.ПолучитьСтатусКонфигурации(Стр.ИмяКонфигурации, Объект.Ссылка);
		
		ДобавитьКонфигурациюВТаблицу(Стр.ИмяКонфигурации, Стр.МаксимумСлотов, СлотовЗанято, Статус);	
		
	КонецЦикла;
	
КонецПроцедуры
